#程序文件Pex12_1.py

# 时间序列分析通常用于分析一个变量随时间的变化趋势，例如股票价格、天气变化、销售额等。
# 当你想要分析一个变量随时间的变化趋势时，可以使用时间序列分析。

# 而回归分析则用来研究自变量和因变量之间的关系，例如预测房价和人口密度的关系、预测销售额与广告费用的关系等。
# 当你想要研究自变量和因变量之间的关系时，可以使用回归分析。
import numpy as np
from sklearn.linear_model import LinearRegression
a=np.loadtxt("E:/数学/数模/Python-MEM-PD-master/12第12章  回归分析/Pdata12_1.txt")   #加载表中x1,x2,y的13行3列数据
md=LinearRegression().fit(a[:,:2],a[:,2])    #构建并拟合模型.1、2列自变量，3列因变量
""" 
这里使用的是 Python 中的切片语法。`a[:,:2]` 表示取二维数组 `a` 的所有行和前两列，也就是取 `a` 的前两列。
而 `a[:,2]` 表示取二维数组 `a` 的所有行和第三列，也就是取 `a` 的第三列。
在 Python 中，索引是从 0 开始的，所以第三列的索引是 2。 """

y=md.predict(a[:,:2])       #求预测值

b0=md.intercept_; b12=md.coef_   #输出回归系数
R2=md.score(a[:,:2],a[:,2])      #计算R^2
print("b0=%.4f\nb12=%.4f%10.4f"%(b0,b12[0],b12[1]))
print("拟合优度R^2=%.4f"%R2)
