#程序文件Pex13_3.py
x0=1000000; r=0.005; N=500; n=0; xm=8000
x1=x0*(1+r)-xm
while n<=N and x1>0:
    n+=1
    if n%12==0: print("第%d个月末欠钱：x(%d)=%.4f"%(n,n,x1))
    x0=x1; x1=x0*(1+r)-xm
print("还款月数n=",n+1)
print("还款%d年%d个月"%((n+1)//12,n+1-12*((n+1)//12)))

# 递归解差分方程模板
""" 
# 定义初始变量
x0 = ... # 初始值
r = ... # 常数
N = ... # 最大迭代次数
n = 0 # 当前迭代次数

# 计算第一个值
x1 = ... # 根据差分方程计算

# 迭代计算
while n <= N and ...: # 迭代终止条件
    n += 1
    # 打印中间结果（可选）
    if n % ... == 0:
        print("第%d步：x(%d)=%.4f" % (n, n, x1))
    # 更新变量
    x0 = x1
    x1 = ... # 根据差分方程计算

# 打印最终结果
print("迭代次数n=", n) """
